import pandas as pd
import numpy as np

df = pd.read_csv('/opt/ml/boosting/sentiment/sentidata/aihub.csv')
df['split'] = np.random.randn(df.shape[0], 1)
df = df.dropna(axis=0)
label_dict = {
    '상처/고립된' : '상처',
    '상처/배신당한' : '상처',
    '당황/고립된' : '당황',
    '불안/취약한' : '불안',
    '당황/남의 시선 의식하는' : '당황',
    '기쁨' : '긍정',
    '불안' : '불안',
    '슬픔/우울한 ' : '슬픔',
    '분노/짜증나는' : '분노',
    '분노/방어적인 ' : '분노',
    '불안/스트레스 받는' : '불안',
    '슬픔/환멸을 느끼는' : '슬픔',
    '분노/구역질 나는' : '분노',
    '기쁨/만족스러운 ' : '긍정',
    '상처/질투하는' : '상처',
    '상처/괴로워하는' : '상처',
    '불안/혼란스러운 ' : '불안',
    '슬픔/낙담한' : '슬픔',
    '분노/성가신' : '분노',
    '슬픔' : '슬픔',
    '기쁨/안도하는' : '긍정',
    '슬픔/비통한' : '슬픔',
    '당황/혼란스러운' : '당황',
    '기쁨/흥분되는 ' : '긍정',
    '기쁨/사랑하는' : '긍정',
    '불안/회의적인' : '불안',
    '불안/당혹스러운 ' : '불안',
    '상처/희생된' : '상처',
    '상처/불우한 ' : '상처',
    '분노/툴툴대는' : '분노',
    '당황/부끄러운' : '당황',
    '기쁨/신이 난' : '긍정',
    '기쁨/감사하는' : '감사',
    '분노/좌절한' : '분노',
    '상처/억울한' : '상처',
    '분노/안달하는' : '분노',
    '당황' : '당황',
    '불안/조심스러운' : '불안',
    '상처/버려진' : '상처',
    '불안/걱정스러운' : '불안',
    '당황/열등감 ' : '당황',
    '분노' : '분노',
    '기쁨/편안한' : '긍정',
    '슬픔/후회되는' : '슬픔',
    '당황/혐오스러운' : '부정',
    '슬픔/마비된 ' : '슬픔',
    '슬픔/염세적인' : '슬픔',
    '당황/외로운' : '당황',
    '분노/악의적인 ' : '분노',
    '불안/두려운' : '불안',
    '분노/노여워하는' : '분노',
    '기쁨/자신하는' : '긍정',
    '기쁨/느긋한' : '긍정',
    '당황/죄책감 ' : '당황',
    '슬픔/눈물이 나는' : '슬픔',
    '상처' : '상처',
    '슬픔/실망한' : '슬픔',
    '상처/충격 받은 ' : '상처',
    '불안/초조한' : '불안',
    '당황/한심한' : '당황'
    }
df['emotion'].replace(label_dict, inplace=True)
print(len(list(set(df['emotion']))))
msk = np.random.rand(len(df)) <= 0.9

train = df[msk]
test = df[~msk]

train.to_csv('train.csv',encoding="utf8", index=False)
test.to_csv('test.csv',encoding="utf8", index=False)